(function (ko) {

    ko.bindingHandlers.editableText = {
        init: function (element, valueAccessor) {
            var
                $element = $(element),
                text = valueAccessor().text,
                multiline = valueAccessor().multiline
            ;

            $element.attr('contenteditable', 'true');
            $element.text(ko.unwrap(text));

            $element.on('drop dragover', function (event) {
                event.preventDefault();
                event.stopPropagation();
            }).on('paste', function (event) {
                var clipboardData = event.originalEvent.clipboardData || window.clipboardData;
                pasteTextAtCaret(clipboardData.getData('text'), false);

                event.preventDefault();
                event.stopPropagation();
            }).on('keypress', function (event) {
                if (event.keyCode != 13) {
                    return;
                }

                if (multiline) {
                    pasteTextAtCaret('\n', false);
                } else {
                    $element.blur();
                }

                event.preventDefault();
                event.stopPropagation();
            });

            var saveIntervalId = setInterval(function () {
                if (ko.unwrap(text) != $element.text()) {
                    text($element.text());
                }
            }, 100);

            ko.utils.domNodeDisposal.addDisposeCallback(element, function () {
                clearInterval(saveIntervalId);
            });

            function pasteTextAtCaret(html, selectPastedContent) {
                if (!multiline)
                    html = html.replace(/(\r\n|\n|\r)/gm, " ");

                var sel, range;

                sel = window.getSelection();
                if (sel.getRangeAt && sel.rangeCount) {
                    range = sel.getRangeAt(0);
                    range.deleteContents();

                    // Range.createContextualFragment() would be useful here but is
                    // only relatively recently standardized and is not supported in
                    // some browsers (IE9, for one)

                    var el = $('<span>').text(html)[0];
                    var frag = document.createDocumentFragment(), node, lastNode;
                    while ((node = el.firstChild)) {
                        lastNode = frag.appendChild(node);
                    }
                    var firstNode = frag.firstChild;
                    range.insertNode(frag);

                    // Preserve the selection
                    if (lastNode) {
                        range = range.cloneRange();
                        range.setStartAfter(lastNode);
                        if (selectPastedContent) {
                            range.setStartBefore(firstNode);
                        } else {
                            range.collapse(true);
                        }
                        sel.removeAllRanges();
                        sel.addRange(range);
                    }
                }
            }

        },
        update: function (element, valueAccessor, allBindingsAccessor, viewModel, bindingContext) {
            var text = ko.unwrap(valueAccessor().text);
            var $element = $(element);

            if (text != $element.text())
                $element.text(text);
        }
    }

    ko.bindingHandlers.typeahead = {
        init: function (element, valueAccessor, allBindingsAccessor) {

            var substringMatcher = function (strs) {
                return function findMatches(q, cb) {
                    var
                        matches,
                        substrRegex;
                    matches = [];
                    substrRegex = new RegExp(q, 'i')
                    ;

                    $.each(strs, function (i, str) {
                        if (substrRegex.test(str)) {
                            matches.push({ value: str });
                        }
                    });

                    cb(matches);
                };
            };

            var
                value = valueAccessor(),
                allBindings = allBindingsAccessor()
            ;

            $(element).typeahead({
                hint: true,
                highlight: true,
                minLength: 1
            },
            {
                source: substringMatcher(ko.unwrap(value))
            }).on('typeahead:selected', function () {
                if (ko.isWriteableObservable(allBindings.value)) {
                    allBindings.value($(element).val());
                }
            });

            $(element).on('keypress', function (e) {
                if (e.keyCode == 13) {
                    e.preventDefault();
                    e.stopImmediatePropagation();
                }
            });
        }
    }

})(window.ko);
(function (ko) {

    ko.extenders.required = function (target) {
        target.isValid = ko.computed(function () {
            return target() && target().trim().length > 0;
        });
        return target;
    };

    ko.extenders.phone = function (target) {
        var result = ko.computed({
            read: target,
            write: function (newValue) {
                var
                    currentValue = target(),
                    valueToWrite
                ;
                if (typeof newValue == typeof undefined) {
                    valueToWrite = undefined;
                }
                else if (isNaN(newValue)) {
                    valueToWrite = currentValue;
                } else {
                    valueToWrite = newValue;
                }

                if (valueToWrite != currentValue) {
                    target(valueToWrite);
                } else {
                    if (newValue != currentValue) {
                        target.notifySubscribers(valueToWrite);
                    }
                }

            }
        }).extend({ notify: 'always' });

        result.isValid = ko.computed(function () {
            return !!result();
        });

        result(target());

        return result;
    };

})(window.ko);


(function () {

    $('body').on('keypress', 'textarea', function (e) {
        if (e.ctrlKey && ((e.keyCode == 13) || e.keyCode == 10)) {
            $(this).closest('form').submit();
        }
    });


    var viewModel = {
        isFormVisible: ko.observable(true),
        isDocumentVisible: ko.observable(false),
        isSummaryVisible: ko.observable(false),

        showValidationError: ko.observable(false),

        id: ko.observable(),

        description: ko.observable().extend({ required: true }),
        street: ko.observable().extend({ required: true }),
        streets: getStreets(),
        building: ko.observable().extend({ required: true }),
        flat: ko.observable().extend({ required: true }),
        lastname: ko.observable().extend({ required: true }),
        firstname: ko.observable().extend({ required: true }),
        middlename: ko.observable().extend({ required: true }),
        phone: ko.observable().extend({ phone: true }),

        isDelegated: ko.observable(false),

        start: start,
        showForm: showForm,
        showDocument: showDocument,
        submitAndShowSummary: submitAndShowSummary,
        open: open,
        delegate: delegate
    }


    viewModel.isValid = ko.computed(function () {
        return viewModel.description.isValid()
            && viewModel.street.isValid()
            && viewModel.building.isValid()
            && viewModel.flat.isValid()
            && viewModel.lastname.isValid()
            && viewModel.firstname.isValid()
            && viewModel.middlename.isValid()
            && viewModel.phone.isValid();
    });


    function start() {
        showForm();
        viewModel.showValidationError(false);
        viewModel.id(undefined);
        viewModel.firstname(undefined);
        viewModel.lastname(undefined);
        viewModel.middlename(undefined);
        viewModel.phone(undefined);
        viewModel.street(undefined);
        viewModel.building(undefined);
        viewModel.flat(undefined);
        viewModel.description(undefined);
    }

    function showForm() {
        viewModel.isFormVisible(true);
        viewModel.isDocumentVisible(false);
        viewModel.isSummaryVisible(false);
        $(window).scrollTop($('#report').offset().top);
    }

    function showDocument() {
        viewModel.showValidationError(true);

        if (!viewModel.isValid()) {
            return;
        }

        viewModel.isFormVisible(false);
        viewModel.isDocumentVisible(true);

        $(window).scrollTop($('#report').offset().top);
    }

    function submitAndShowSummary() {
        if (!viewModel.isValid()) {
            return;
        }

        viewModel.isDocumentVisible(false);
        viewModel.isSummaryVisible(true);

        $(window).scrollTop($('#report').offset().top);

        var data = {
            description: ko.unwrap(viewModel.description),
            lastname: ko.unwrap(viewModel.lastname),
            firstname: ko.unwrap(viewModel.firstname),
            middlename: ko.unwrap(viewModel.middlename),
            phone: ko.unwrap(viewModel.phone),
            street: ko.unwrap(viewModel.street),
            building: ko.unwrap(viewModel.building),
            flat: ko.unwrap(viewModel.flat)
        }

        $.ajax('/api/report', {
            type: 'POST',
            data: data
        }).success(function (response) {
            viewModel.id(response);
        });

    }

    function open() {
        var id = ko.unwrap(viewModel.id);
        if (id) {
            window.open('/api/report/' + id);
        }
    }

    function delegate() {
        var id = ko.unwrap(viewModel.id);
        if (id) {
            $.ajax('/api/delegate', {
                type: 'POST',
                data: { id: id }
            }).success(function () {
                viewModel.isDelegated(true);
            });
        }
    }

    ko.applyBindings(viewModel);

    function getStreets() {
        return [
            "вул. 8 Березня",
            "вул. Авіаторів",
            "вул. Адмірала Щастного",
            "вул. Академіка Векслера",
            "вул. Академіка Дашкевича",
            "п-д Академіка Липського",
            "вул. Академіка Скальковського",
            "пров. Академіка Слуцького",
            "п-д Академіка Тутковського",
            "пров. Алея Садова",
            "пров. Альбрехта",
            "вул. Андріївська",
            "п-д Андріївський",
            "пров. Андріївський узвіз 1-й",
            "пров. Андріївський узвіз",
            "пров. Артема Любовича 1-й",
            "пров. Артема Любовича 2-й",
            "вул. Артема Любовича",
            "пров. Артільний",
            "вул. Археологічна",
            "п-д Археологічний",
            "вул. Бальзаківська",
            "пров. Баранівський",
            "вул. Баранова",
            "вул. Барашівська",
            "пров. Барашівський 1-й",
            "пров. Барашівський 2-й",
            "вул. Басейна",
            "вул. Басова",
            "пров. Бджолиний",
            "пров. Безименського",
            "пров. Бердичівський 1-й",
            "пров. Бердичівський 2-й",
            "п-д Бердичівський",
            "пров. Береговий",
            "вул. Березівська",
            "пров. Березівський 1-й",
            "пров. Березівський 3-й",
            "пров. Березівський 4-й",
            "пров. Березівський 5-й",
            "пров. Березівський 7-й",
            "п-д Бєльського",
            "вул. Білоруська",
            "вул. Богдана Хмельницького",
            "пров. Богуна",
            "вул. Богунська",
            "п-д Богунський 1-й",
            "пров. Богунський 1-й",
            "п-д Богунський 2-й",
            "пров. Богунський 2-й",
            "п-д Богунський 3-й",
            "п-д Богунський 4-й",
            "п-д Богунський 5-й",
            "пров. Боженка 2-й",
            "пров. Боженка 3-й",
            "вул. Болгарська",
            "вул. Бондарна",
            "п-д Бондарний",
            "пров. Бондарний",
            "вул. Бориса Лятошинського",
            "вул. Бориса Тена",
            "вул. Бородія",
            " БОС",
            "пров. Ботанічний",
            "пров. Брасюка",
            "вул. Бугайченка",
            "вул. Будівельна",
            "пров. Будівельний",
            "вул. Будьонного",
            "вул. Бялика",
            "вул. В’ячеслава Малі",
            "пров. Ватутіна 1-й",
            "вул. Ватутіна",
            "пров. Ватутіна",
            "пров. Вацківський",
            "вул. Вацлава Длоуги",
            "вул. Велика Бердичівська",
            "п-д Вересковий",
            "пров. Веселий",
            "пров. Весняний",
            "пров. Взуттєвий",
            "вул. Видумка",
            "майд. Визволення",
            "пров. Виноградний",
            "пров. Винокурний 1-й",
            "пров. Винокурний 2-й",
            "пров. Винокурний 4-й",
            "пров. Виробничий",
            "пров. Вишневий 1-й",
            "пров. Вишневий 2-й",
            "пров. Вишневий 3-й",
            "пров. Вишневий 4-й",
            "пров. Вишневий 5-й",
            "пров. Вишневий 6-й",
            "пров. Вільський 1-й",
            "пров. Вільський 2-й",
            "пров. Вільський 3-й",
            "пров. Вільський 4-й",
            "вул. Вінницька",
            "вул. Вітрука",
            "пров. Водопровідний",
            "вул. Войкова",
            "пров. Войкова",
            "вул. Вокзальна",
            "пров. Вокзальний",
            "п-д Волошковий",
            "вул. Ворошилова",
            "пров. Вузький",
            "вул. Гагаріна",
            "вул. Гайдамацька",
            "пров. Галанчикової",
            "п-д Галицький",
            "пров. Галовий",
            "п-д Гамченка",
            "вул. Гаражна",
            "вул. Генерала Потапова",
            "вул. Героїв Пожежних",
            "вул. Героїв Сталінграда",
            "вул. Героїв Чорнобиля",
            "вул. Гетьмана Виговського",
            "вул. Гетьмана Самойловича",
            "вул. Гоголівська",
            "пров. Гоголівський 1-й",
            "пров. Гоголівський 2-й",
            "пров. Гоголівський 3-й",
            "вул. Гончарна",
            "пров. Гончарний",
            "пров. Городній",
            "пров. Госпітальний 1-й",
            "пров. Госпітальний 2-й",
            "пров. Госпітальний 3-й",
            "вул. Гранітна",
            "пров. Гранітний 2-й",
            "вул. Гречка",
            "п-д Грибний",
            "пров. Гуйвинський",
            "пров. Давидівський",
            "п-д Далекий 1-й",
            "п-д Далекий 2-й",
            "п-д Далекий 3-й",
            "п-д Далекий 4-й",
            "п-д Далекий 5-й",
            "вул. Дачна",
            "пров. Дачний 1-й",
            "пров. Дачний 10-й",
            "пров. Дачний 11-й",
            "пров. Дачний 2-й",
            "пров. Дачний 4-й",
            "пров. Дачний 5-й",
            "пров. Дачний 6-й",
            "пров. Дачний 8-й",
            "пров. Дачний 9-й",
            "майд. Декабристів",
            "вул. Дениса Давидова",
            "вул. Денишівська",
            "пров. Деревообробний",
            "пров. Джерельний",
            "вул. Дитячої комуни",
            "вул. Дібровна",
            "вул. Дмитрівська",
            "вул. Довженка",
            "вул. Домбровського",
            "пров. Дружби 1-й",
            "пров. Дружби 2-й",
            "вул. Дружби",
            "пров. Евеліни Ганської",
            "вул. Ємельянова",
            "пров. Ємельянова",
            "пров. Живичний",
            "пров. Житній 1-й",
            "пров. Житній 2-й",
            "вул. Житній базар",
            "пров. Жоржиновий",
            "вул. Жуйка",
            "вул. Заводська",
            "пров. Заводський 1-й",
            "пров. Завокзальний 1-й",
            "пров. Завокзальний 2-й",
            "вул. Закам’янська",
            "вул. Залізнична",
            "пров. Залізничний 1-й",
            "вул. Замкова",
            "майд. Замковий",
            "вул. Зарічна",
            "п-д Затишний",
            "вул. Західна",
            "пров. Західний 1-й",
            "пров. Західний 2-й",
            "пров. Західний 3-й",
            "пров. Західний 4-й",
            "пров. Західний 5-й",
            "пров. Західний 6-й",
            "пров. Західний 7-й",
            "вул. Зв’язківців",
            "вул. Звягельська",
            "майд. Згоди",
            "вул. Зелена",
            "пров. Зелений 1-й",
            "пров. Зелений 2-й",
            "пров. Зелений 3-й",
            "пров. Зелений 4-й",
            "пров. Зелений Бір",
            "пров. Зенітний",
            "вул. Зоряна",
            "п-д Зручний",
            "вул. Івана Білика",
            "п-д Івана Богуна",
            "вул. Івана Гонти",
            "пров. Івана Гонти",
            "вул. Івана Кочерги",
            "вул. Івана Огієнка",
            "вул. Івана Франка",
            "пров. Іванівський",
            "майд. ім. С.П. Корольова",
            "вул. Індустріальна",
            "пров. Індустріальний 1-й",
            "пров. Індустріальний 2-й",
            "пров. Індустріальний 3-й",
            "п-д Індустріальний",
            "п-д Інститутський",
            "пров. Іподромний 1-й",
            "пров. Іподромний 2-й",
            "п-д Іршанський",
            "пров. Кавалерійський",
            "вул. Калинова",
            "пров. Кам’яний узвіз",
            "пров. Кар’єрний 1-й",
            "пров. Кар’єрний 2-й",
            "пров. Кар’єрний 3-й",
            "вул. Каракульна",
            "пров. Каракульний 1-й",
            "пров. Каракульний 2-й",
            "пров. Каракульний 3-й",
            "пров. Каракульний 4-й",
            "пров. Каретний",
            "пров. Кармалюка 1-й",
            "пров. Кармалюка 2-й",
            "вул. Кармалюка",
            "п-д Кароля Гейнча",
            "вул. Кафедральна",
            "вул. Каховська",
            "пров. Каховський 1-й",
            "пров. Каховський 2-й",
            "пров. Каховський 3-й",
            "пров. Каховський 4-й",
            "п-д Каховський",
            "пров. Квітковий",
            "вул. Кибальчича",
            "вул. Київська",
            "шосе Київське",
            "пров. Київський 1-й",
            "пров. Київський 2-й",
            "пров. Київський 3-й",
            "пров. Київський 4-й",
            "вул. Кільцева",
            "пров. Кільцевий",
            "пров. Кірова 1-й",
            "п-д Кмитівський",
            "пров. Ковальський 1-й",
            "пров. Ковальський 2-й",
            "п-д Ковальський",
            "вул. Козацька",
            "пров. Козубського",
            "вул. Козятинська",
            "пров. Колгоспний 1-й",
            "пров. Колгоспний 2-й",
            "пров. Колективний 1-й",
            "пров. Колективний 2-й",
            "пров. Колективний 3-й",
            "вул. Комерційна",
            "пров. Комунальний",
            "вул. Корабельна",
            "пров. Корбутівський",
            "пров. Короленка 1-й",
            "пров. Короленка 2-й",
            "пров. Короленка 3-й",
            "вул. Короленка",
            "майд. Короленка",
            "пров. Корольова 1-й",
            "вул. Корольова",
            "вул. Коростишівська",
            "пров. Косачів",
            "вул. Косіора",
            "вул. Космонавтів",
            "пров. Котельникова",
            "вул. Котляревського",
            "вул. Котовського",
            "вул. Коцюбинського",
            "п-д Крайній",
            "пров. Крайній",
            "вул. Красовського",
            "пров. Крашевського",
            "пров. Кривий 1-й",
            "пров. Кривий 2-й",
            "пров. Кривий Брід 1-й",
            "пров. Кривий Брід 2-й",
            "пров. Кривий Брід 3-й",
            "пров. Кривий Брід 4-й",
            "пров. Кривий Брід 5-й",
            "вул. Кривий Брід",
            "п-д Кривий Брід",
            "пров. Крилова",
            "вул. Крошенська",
            "наб. Крошенська",
            "пров. Крошенський 1-й",
            "пров. Крошенський 2-й",
            "пров. Крошенський 3-й",
            "пров. Крошенський 4-й",
            "пров. Крошенський 5-й",
            "пров. Крутий",
            "пров. Кудрицького",
            "пров. Культурний",
            "вул. Купальна",
            "пров. Курганний 1-й",
            "пров. Курганний 2-й",
            "пров. Курганний 3-й",
            "пров. Леваневського 1-й",
            "пров. Леваневського 2-й",
            "пров. Леваневського 3-й",
            "вул. Леваневського",
            "пров. Левківський",
            "вул. Лермонтовська",
            "вул. Леселідзе",
            "вул. Лесі Українки",
            "пров. Ливарний 1-й",
            "пров. Ливарний 2-й",
            "вул. Лівонабережна р. Кам'янки",
            "пров. Лікарський",
            "пров. Лікаря Бланка",
            "вул. Лісна",
            "пров. Лісний 1-й",
            "пров. Лісний 2-й",
            "пров. Лісний 3-й",
            "пров. Лісний 4-й",
            "пров. Лісний 5-й",
            "пров. Лугинський",
            "вул. Лугова",
            "пров. Луговий",
            "вул. Лук’яненка",
            "вул. Луцька",
            "п-д Луцький",
            "вул. Любарська",
            "пров. Люби Шевцової",
            "вул. Лятошинського",
            "пров. Льва Нікуліна",
            "пров. Льва Толстого 1-й",
            "пров. Льва Толстого 2-й",
            "вул. Льва Толстого",
            "вул. Львівська",
            "пров. Львівський",
            "вул. Магазинна",
            "пров. Магазинний 1-й",
            "пров. Магазинний 2-й",
            "пров. Магазинний 3-й",
            "пров. Магазинний 4-й",
            "пров. Магазинний 5-й",
            "пров. Максютова 1-й",
            "пров. Максютова 2-й",
            "пров. Максютова 3-й",
            "пров. Максютова 4-й",
            "пров. Максютова 6-й",
            "пров. Максютова 7-й",
            "пров. Максютова 8-й",
            "пров. Максютова 9-й",
            "вул. Максютова",
            "вул. Мала Бердичівська",
            "пров. Малий",
            "вул. Маликова",
            "вул. Малинова",
            "вул. Малинська",
            "вул. Малікова",
            "наб. Мальованська",
            "пров. Мальованський",
            "пров. Мальовничий",
            "пров. Мануїльського 1-й",
            "пров. Мануїльського 2-й",
            "пров. Мануїльського 3-й",
            "пров. Мануїльського 4-й",
            "вул. Мануїльського",
            "п-д Мануїльського",
            "вул. Мар’янівська",
            "пров. Мар’янівський 1-й",
            "пров. Мар’янівський 2-й",
            "пров. Мар’янівський 3-й",
            "п-д Мар’янівський",
            "вул. Маршала Жукова",
            "вул. Маршала Рибалка",
            "пров. Матросова 1-й",
            "пров. Матросова 2-й",
            "вул. Маяковського",
            "пров. Меблевий",
            "пров. Медовий",
            "пров. Метеорологічний 1-й",
            "пров. Метеорологічний 2-й",
            "п-д Метеорологічний",
            "пров. Метеорологічний",
            "вул. Миклухо-Маклая",
            "вул. Миколи Лисенка",
            "пров. Миру 1-й",
            "пров. Миру 2-й",
            "пров. Миру 3-й",
            "вул. Миру",
            "просп. Миру",
            "пров. Мисливський 1-й",
            "пров. Мисливський 2-й",
            "майд. Мистецькі ворота",
            "вул. Михайлівська",
            "пров. Мічурінський",
            "вул. Млинова",
            "пров. Млиновий",
            "пров. Молодіжний",
            "вул. Монолітна",
            "вул. Монтана",
            "пров. Московський 2-й",
            "пров. Музичний",
            "вул. Набережна",
            "пров. Набережний",
            "пров. Нагірний",
            "вул. Народицька",
            "пров. Нафтовий",
            "вул. Небесної сотні (Московська)",
            "вул. Нескорених",
            "вул. Нова",
            "бульв. Новий",
            "пров. Новий",
            "вул. Новогоголівська",
            "п-д Новогоголівський 1-й",
            "пров. Новогоголівський 1-й",
            "п-д Новогоголівський 2-й",
            "пров. Новогоголівський 2-й",
            "п-д Новогоголівський 3-й",
            "пров. Новогоголівський 3-й",
            "вул. Новопівнічна",
            "пров. Новопівнічний 1-й",
            "пров. Новопівнічний 2-й",
            "п-д Новоселів",
            "вул. Новосінна",
            "пров. Овочевий",
            "вул. Огурцова",
            "п-д Ожиновий",
            "пров. Оздоровчий",
            "вул. Озерна",
            "пров. Олега Кошового",
            "вул. Олександра Байка",
            "вул. Олександра Клосовського",
            "вул. Олександра Олеся",
            "вул. Олени Пчілки",
            "вул. Оліївська",
            "вул. Ольжича",
            "пров. Оранжерейний",
            "вул. Орлова",
            "пров. Орлова",
            "п-д Осокоровий",
            "пров. Остапа Вишні",
            "пров. Островського 1-й",
            "пров. Островського 2-й",
            "вул. Островського",
            "вул. Офіцерська",
            "вул. Охрімова Гора",
            "вул. Павла Тетері",
            "пров. Павликівський 1-й",
            "вул. Павловська Гора",
            "пров. Паволоцький",
            "пров. Паперовий",
            "пров. Парашутний",
            "вул. Паркова",
            "пров. Парковий",
            "вул. Парникова",
            "пров. Парниковий",
            "пров. Паровозний 1-й",
            "пров. Паровозний 2-й",
            "вул. Перемоги",
            "майд. Перемоги",
            "вул. Перехідна",
            "пров. Перехідний",
            "вул. Перша Партизанська",
            "вул. Першого Травня",
            "пров. Першотравневий 1-й",
            "пров. Першотравневий 2-й",
            "пров. Першотравневий 3-й",
            "пров. Першотравневий 4-й",
            "пров. Першотравневий 5-й",
            "вул. Петровського",
            "пров. Пивоварний",
            "вул. Південна",
            "пров. Південний 1-й",
            "пров. Південний 2-й",
            "вул. Північна",
            "пров. Північний",
            "наб. Під Скелями",
            "вул. Під’їзна",
            "вул. Піонерська",
            "пров. Піонерський 1-й",
            "пров. Піонерський 10-й",
            "пров. Піонерський 2-й",
            "пров. Піонерський 3-й",
            "пров. Піонерський 4-й",
            "пров. Піонерський 5-й",
            "пров. Піонерський 6-й",
            "пров. Піонерський 7-й",
            "пров. Піонерський 8-й",
            "пров. Піонерський 9-й",
            "п-д Піонерський",
            "пров. Піонерських таборів",
            "вул. Піщана",
            "п-д Піщаний",
            "пров. Піщаний",
            "вул. Подільська",
            "пров. Подільський",
            "п-д Поліський",
            "пл. Польова",
            "п-д Польовий 2-й",
            "пров. Польовий 2-й",
            "пров. Польовий 3-й",
            "пров. Польовий 5-й",
            "пров. Польовий 6-й",
            "бульв. Польський",
            "бульв. Польський",
            "пров. Попова",
            "вул. Привітна",
            "майд. Привокзальний",
            "пров. Прикордонний",
            "пров. Провіантський",
            "вул. Пролетарська",
            "пров. Пролетарський 1-й",
            "пров. Пролетарський 2-й",
            "пров. Пролетарський 3-й",
            "вул. Промислова",
            "пров. Прорізний",
            "вул. Професора Антоновича",
            "п-д Професора Арциховського",
            "пров. Прохідний",
            "пров. Прудний",
            "майд. Путятинський",
            "пров. Путятинський",
            "вул. Пушкінська",
            "вул. Пшенична",
            "пров. Радіщева 1-й",
            "вул. Радіщева",
            "п-д Радомишльський",
            "вул. Радонова",
            "пров. Рилєєва",
            "вул. Рильського",
            "пров. Рівний 1-й",
            "пров. Рівний",
            "пров. Річковий",
            "вул. Робітнича",
            "п-д Рожевий",
            "вул. Російська Слобідка",
            "вул. Росяна",
            "вул. Руданська",
            "пров. Руднянський 1-й",
            "пров. Руднянський 2-й",
            "майд. Руднянський",
            "вул. Сабурова",
            "вул. Садова",
            "пров. Садовий",
            "вул. Саєнка",
            "пров. Саєнка",
            "вул. Санаторна",
            "пров. Санаторний 1-й",
            "пров. Санаторний",
            "вул. Світинська",
            "вул. Свободи",
            "п-д Свободи",
            "пров. Свободи",
            "вул. Северина Наливайка",
            "вул. Селецька",
            "пров. Селецький 1-й",
            "пров. Селецький 2-й",
            "пров. Селецький 3-й",
            "пров. Селецький 4-й",
            "пров. Селецький",
            "пров. Семена Палія",
            "пров. Семенівський",
            "пров. Сергія Тюленіна",
            "пров. Середній",
            "пров. Сікорського",
            "п-д Сільськогосподарський",
            "пров. Сільськогосподарський",
            "пров. Сінний 1-й",
            "пров. Сінний 2-й",
            "вул. Сінокісна",
            "пров. Скельний",
            "пров. Скіфський",
            "пров. Склянського",
            "п-д Скорульського",
            "вул. Слобідська",
            "пров. Слов’янський",
            "пров. Смаковий",
            "пров. Смоківський 1-й",
            "пров. Смоківський 2-й",
            "п-д Смоківський 3-й",
            "пров. Смоківський 3-й",
            "пров. Смолянський 1-й",
            "пров. Смолянський 2-й",
            "пров. Смолянський 3-й",
            "пров. Смолянський 4-й",
            "пров. Смолянський 5-й",
            "майд. Смолянський",
            "майд. Соборний",
            "вул. Соколова Гора",
            "пров. Сонячний",
            "пров. Соняшниковий",
            "вул. Соснова",
            "пров. Сосновий 1-й",
            "пров. Сосновий 2-й",
            "пров. Сосновий 3-й",
            "майд. Сосновий",
            "пров. Спортивний",
            "п-д Ставровський",
            "пров. Ставровський",
            "вул. Стадіонна",
            "пров. Стадіонний",
            "майд. Станишівський",
            "бульв. Старий",
            "вул. Старовільська",
            "вул. Старогончарна",
            "вул. Стародавня",
            "п-д Старокиївський 1-й",
            "пров. Старокиївський 1-й",
            "п-д Старокиївський 2-й",
            "пров. Старокиївський 2-й",
            "п-д Старокиївський 3-й",
            "пров. Старокиївський 3-й",
            "пров. Старокиївський 5-й",
            "пров. Старокиївський 6-й",
            "пров. Старокиївський 7-й",
            "пров. Старокиївський 8-й",
            "пров. Старопоштовий 2-й",
            "вул. Старочуднівська",
            "пров. Степовий 1-й",
            "пров. Степовий 2-й",
            "пров. Студентський",
            "пров. Сухий Яр",
            "вул. Східна",
            "пров. Східний",
            "п-д Табірний",
            "пров. Табірний",
            "пров. Танкістів 1-й",
            "пров. Танкістів 2-й",
            "пров. Танкістів 3-й",
            "вул. Танкістів",
            "вул. Тарновського",
            "вул. Театральна",
            "пров. Тетерівський 1-й",
            "пров. Тетерівський 2-й",
            "п-д Тихий",
            "пров. Тихий",
            "пров. Товаро-Вантажний",
            "пров. Транзитний 1-й",
            "пров. Транзитний 2-й",
            "пров. Транзитний 3-й",
            "пров. Транзитний 4-й",
            "пров. Транзитний 5-й",
            "пров. Транзитний 6-й",
            "пров. Транзитний 7-й",
            "пров. Троковицький",
            "пров. Троянівський",
            "пров. Труда 1-й",
            "пров. Труда 2-й",
            "пров. Труда 3-й",
            "вул. Труда",
            "пров. Туркенича",
            "пров. Тютюновий",
            "п-д Узвіз Стрімкий",
            "пров. Урожайний",
            "пров. Учбовий",
            "пров. Фабричний 1-й",
            "пров. Фабричний 2-й",
            "вул. Фастівська",
            "вул. Фещенка-Чопівського",
            "вул. Фещенко-Чопівського",
            "вул. Фізкультурна",
            "пров. Фізкультурний",
            "вул. Фруктова",
            "пров. Фруктовий 1-й",
            "пров. Фруктовий 2-й",
            "пров. Фруктовий 3-й",
            "пров. Фруктовий 4-й",
            "пров. Фруктовий 5-й",
            "вул. Фрунзе",
            "пров. Фурманова 1-й",
            "пров. Фурманова 2-й",
            "пров. Фурманова 3-й",
            "пров. Хвойний 1-й",
            "пров. Хвойний 2-й",
            "пров. Хитрий ринок",
            "вул. Хіміків",
            "п-д Хінчанський",
            "вул. Хлібна",
            "пров. Хлібний 1-й",
            "пров. Хмельовий 1-й",
            "пров. Хмельовий 2-й",
            "пров. Цегельний",
            "вул. Цегляна",
            "пров. Цілинний",
            "вул. Ціолковського",
            "вул. Цюрупи",
            "п-д Цюрупи",
            "пров. Цюрупи",
            "вул. Чапаєва",
            "пров. Чапаєва",
            "пров. Червоний",
            "вул. Червоноармійська",
            "пров. Червоноармійський 1-й",
            "пров. Червоноармійський 2-й",
            "пров. Червоноармійський 3-й",
            "пров. Червоноармійський",
            "вул. Червоного Хреста",
            "вул. Черняховського",
            "вул. Чеська",
            "пров. Чехова 1-й",
            "пров. Чехова 2-й",
            "вул. Чехова",
            "пров. Чистий",
            "пров. Чкалова 1-й",
            "пров. Чкалова 2-й",
            "пров. Чкалова 3-й",
            "пров. Чкалова 4-й",
            "вул. Чкалова",
            "вул. Чорновола",
            "вул. Чуднівське шосе",
            "пров. Чуднівський 2-й",
            "пров. Чуднівський 3-й",
            "пров. Чуднівський 4-й",
            "вул. Чумацький Шлях",
            "пров. Швейний",
            "вул. Шевченка",
            "пров. Шевченківський 1-й",
            "пров. Шевченківський 2-й",
            "пров. Шевченківський 3-й",
            "вул. Шевченко",
            "вул. Шелушкова",
            "пров. Шкільний",
            "п-д Шлях до греблі",
            "пров. Шодуарівський",
            "вул. Шолом-Алейхема",
            "пров. Шумський",
            "пров. Щорса 2-й",
            "пров. Щорса 3-й",
            "пров. Щорса 4-й",
            "пров. Щорса 5-й",
            "пров. Щорса 6-й",
            "вул. Щорса",
            "п-д Юрія Кондратюка",
            "вул. Юрія Немирича",
            "вул. Якіра",
            "вул. Якубовського",
            "пров. Якубця",
            "вул. Ялинкова",
            "вул. Яна Гамарника",
            "пров. Яна Охоцького",
            "пров. Ясеневий",
            "пров. Ясний"
        ];
    }
})();
